Revit 2026 API

# ITemporaryGraphicsHandler Methods

---

The ITemporaryGraphicsHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | OnClick | Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager. |

#### Reference

ITemporaryGraphicsHandler Interface

Autodesk.Revit.UI Namespace